Core/src/Documents/МинимальныеОстаткиСклада/МинимальныеОстаткиСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МинимальныеОстаткиСклада</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.МинимальныеОстаткиСклада</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/МинимальныеОстаткиСклада/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДобавитьПоГруппе(Команда)
	
	СтруктураВыбора = Новый Структура("МножественныйВыбор", Истина);
	ВыбранныеГруппы = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаВыбораГруппы", СтруктураВыбора);
	Результат = ВыбранныеГруппы.ОткрытьМодально();
	Если НЕ Результат = Неопределено Тогда
		ДобавитьПоГруппеНаСервере(Результат);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоГруппеНаСервере(ВыбранныеГруппы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Запасы.Номенклатура
		|ПОМЕСТИТЬ Запасы
		|ИЗ
		|	&Запасы КАК Запасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Ссылка В ИЕРАРХИИ(&ВыбранныеГруппы)
		|	И НЕ Номенклатура.Ссылка В
		|				(ВЫБРАТЬ
		|					Запасы.Номенклатура
		|				ИЗ
		|					Запасы КАК Запасы)";
	Запрос.УстановитьПараметр("ВыбранныеГруппы",	ВыбранныеГруппы);
	Запрос.УстановитьПараметр("Запасы", 			Объект.Запасы.Выгрузить());
	ТаблицаНоменклатур = Запрос.Выполнить().Выгрузить();
		
	Для Каждого СтрокаТЧ ИЗ ТаблицаНоменклатур Цикл
		НовСтрока = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	//Lazare_
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.МинимальныеОстаткиСклада.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	//_Lazare	

КонецПроцедуры


// ЗагрузкаДанныхИзВнешнегоИсточника
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Запасы.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;
		
		//Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		//	
		//	НоваяСтрокаТовары.Характеристика = СтрокаТаблицы.Характеристика;
		//	
		//КонецЕсли;
		//
		//НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
		
		//Если ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения") Тогда
		//	
		//	НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
		//	
		//ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТовары.Номенклатура) Тогда
		//	
		//	НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.Номенклатура.ЕдиницаИзмерения;
		//	
		//КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		//Иначе
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.Номенклатура.СтавкаНДС;
		//КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	//
	//Для каждого СтрокаТаблицы Из Объект.Запасы Цикл 
	//	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТаблицы);
	//КонецЦикла;
	//
	//ОбновитьПодвалФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе
		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура,Количество";
				//Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
				//	
				//	ИменаСвойств = ИменаСвойств + ", Характеристика";
				//	
				//КонецЕсли;
				//
				//Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
				//	
				//	ИменаСвойств = ИменаСвойств + ", Партия";
				//	
				//КонецЕсли;
				//
				//Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
				//	
				//	ИменаСвойств = ИменаСвойств + ", СтранаПроисхождения, НомерГТД";
				//	
				//КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);
				
				//НоваяСтрока.ТипНоменклатурыЗапас = (НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
				//НоваяСтрока.Цена = СтрокаТаблицы.Цена;
				ОбработатьТаблицуНаСервереВезИзм(НоваяСтрока);
				//НоваяСтрока.Сумма = НоваяСтрока.Цена * СтрокаТаблицы.Количество;
				
				//Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				//	
				//	Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
				//		
				//		НоваяСтрока.СтавкаНДС = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.СтавкаНДС), НоваяСтрока.Номенклатура.СтавкаНДС, Объект.Организация.СтавкаНДСПоУмолчанию);
				//		
				//	КонецЕсли;
				//	
				//	Если ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДС) Тогда
				//		
				//		НоваяСтрока.СуммаНДС = СтрокаТаблицы.СуммаНДС;
				//		
				//	Иначе
				//		
				//		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
				//		
				//		НоваяСтрока.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
				//			НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
				//			НоваяСтрока.Сумма * СтавкаНДС / 100);
				//		
				//	КонецЕсли;
				//	
				//Иначе
					
					//НоваяСтрока.СтавкаНДС = ?(Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС,
					//	УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС(),
					//	УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
					//
					//НоваяСтрока.СуммаНДС = 0;
				//	
				//КонецЕсли;
				
				//НоваяСтрока.Всего = НоваяСтрока.Сумма + ?(Объект.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ka='მონაცემების ჩატვირთვა';ru='Загрузка данных';en='Loading data'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьТаблицуНаСервереВезИзм(Строка)
		
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
	//СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
	//СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	//Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
	//	
	//	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	//	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	//	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	//	СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
	//	СтруктураДанные.Вставить("Коэффициент", 1);
	//	СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
	//	
	//КонецЕсли;
	
	// ДисконтныеКарты
	//СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	//СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);		
	// Конец ДисконтныеКарты
	
	//СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	//Если Строка.Цена = 0 Тогда
	//	Строка.Цена = СтруктураДанные.Цена;
	//КонецЕсли;
	//
	//Строка.НаименованиеДляРС = Строка(Строка.Номенклатура) + " " + Строка(Строка.Характеристика);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыЗагрузкаДанныхИзВнешнегоИсточника(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайла");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ka='მარაგების ჩატვირთვა ფაილიდან';ru='Загрузка запасов из файла';en='Download the file from the reserves'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	//НастройкиЗагрузкиДанных.Вставить("ПоложениеЗаказаВДокументе", Объект.ПоложениеЗаказаПокупателя);
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "МинимальныеОстаткиСклада.Запасы");
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
	
	
	
КонецПроцедуры
// Конец ЗагрузкаДанныхИзВнешнегоИсточника
